#!/usr/bin/env python
# -*- coding: utf-8 -*-
'''
Created on 2017-8-30

@author: avrong
'''

LOCALE = [
    ["только что", "через несколько секунд"],
    ["%s секунд назад", "через %s секунд"],
    ["минуту назад", "через минуту"],
    ["%s минут назад", "через %s минут"],
    ["час назад", "через час"],
    ["%s часов назад", "через %s часов"],
    ["вчера", "завтра"],
    ["%s дней назад", "через %s дней"],
    ["неделю назад", "через неделю"],
    ["%s недель назад", "через %s недель"],
    ["месяц назад", "через месяц"],
    ["%s месяцев назад", "через %s месяцев"],
    ["год назад", "через год"],
    ["%s лет назад", "через %s лет"],
]
